vintagepc/MINI404/hw/arm/prusa/stm32_registers/generated/common/FDCAN_TYPE_A_registers.h
typedef union {
	struct {
		uint32_t LEC           : 3; // /*!<Last Error Code                          */
		uint32_t ACT           : 2; // /*!<Activity                                 */
		uint32_t EP            : 1; // /*!<Error Passive                            */
		uint32_t EW            : 1; // /*!<Warning Status                           */
		uint32_t BO            : 1; // /*!<Bus_Off Status                           */
		uint32_t DLEC          : 3; // /*!<Data Last Error Code                     */
		uint32_t RESI          : 1; // /*!<ESI flag of last received FDCAN Message  */
		uint32_t RBRS          : 1; // /*!<BRS flag of last received FDCAN Message  */
		uint32_t REDL          : 1; // /*!<Received FDCAN Message                   */
		uint32_t PXE           : 1; // /*!<Protocol Exception Event                 */
		uint32_t _reserved15   : 1;
		uint32_t TDCV          : 7; // /*!<Transmitter Delay Compensation Value     */
		uint32_t _reserved23   : 9;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_fdcan_type_a,psr);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_fdcan_type_a,psr),bits);

typedef union {
	struct {
		uint32_t TDCF          : 7; // /*!<Transmitter Delay Compensation Filter    */
		uint32_t _reserved7    : 1;
		uint32_t TDCO          : 7; // /*!<Transmitter Delay Compensation Offset    */
		uint32_t _reserved15   :17;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_fdcan_type_a,tdcr);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_fdcan_type_a,tdcr),bits);

typedef union {
	struct {
		uint32_t RF0N          : 1; // /*!<Rx FIFO 0 New Message                    */
		uint32_t RF0F          : 1; // /*!<Rx FIFO 0 Full                           */
		uint32_t RF0L          : 1; // /*!<Rx FIFO 0 Message Lost                   */
		uint32_t RF1N          : 1; // /*!<Rx FIFO 1 New Message                    */
		uint32_t RF1F          : 1; // /*!<Rx FIFO 1 Full                           */
		uint32_t RF1L          : 1; // /*!<Rx FIFO 1 Message Lost                   */
		uint32_t HPM           : 1; // /*!<High Priority Message                    */
		uint32_t TC            : 1; // /*!<Transmission Completed                   */
		uint32_t TCF           : 1; // /*!<Transmission Cancellation Finished       */
		uint32_t TFE           : 1; // /*!<Tx FIFO Empty                            */
		uint32_t TEFN          : 1; // /*!<Tx Event FIFO New Entry                  */
		uint32_t TEFF          : 1; // /*!<Tx Event FIFO Full                       */
		uint32_t TEFL          : 1; // /*!<Tx Event FIFO Element Lost               */
		uint32_t TSW           : 1; // /*!<Timestamp Wraparound                     */
		uint32_t MRAF          : 1; // /*!<Message RAM Access Failure               */
		uint32_t TOO           : 1; // /*!<Timeout Occurred                         */
		uint32_t ELO           : 1; // /*!<Error Logging Overflow                   */
		uint32_t EP            : 1; // /*!<Error Passive                            */
		uint32_t EW            : 1; // /*!<Warning Status                           */
		uint32_t BO            : 1; // /*!<Bus_Off Status                           */
		uint32_t WDI           : 1; // /*!<Watchdog Interrupt                       */
		uint32_t PEA           : 1; // /*!<Protocol Error in Arbitration Phase      */
		uint32_t PED           : 1; // /*!<Protocol Error in Data Phase             */
		uint32_t ARA           : 1; // /*!<Access to Reserved Address               */
		uint32_t _reserved24   : 8;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_fdcan_type_a,ir);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_fdcan_type_a,ir),bits);

typedef union {
	struct {
		uint32_t RF0NE         : 1; // /*!<Rx FIFO 0 New Message Enable             */
		uint32_t RF0FE         : 1; // /*!<Rx FIFO 0 Full Enable                    */
		uint32_t RF0LE         : 1; // /*!<Rx FIFO 0 Message Lost Enable            */
		uint32_t RF1NE         : 1; // /*!<Rx FIFO 1 New Message Enable             */
		uint32_t RF1FE         : 1; // /*!<Rx FIFO 1 Full Enable                    */
		uint32_t RF1LE         : 1; // /*!<Rx FIFO 1 Message Lost Enable            */
		uint32_t HPME          : 1; // /*!<High Priority Message Enable             */
		uint32_t TCE           : 1; // /*!<Transmission Completed Enable            */
		uint32_t TCFE          : 1; // /*!<Transmission Cancellation Finished Enable*/
		uint32_t TFEE          : 1; // /*!<Tx FIFO Empty Enable                     */
		uint32_t TEFNE         : 1; // /*!<Tx Event FIFO New Entry Enable           */
		uint32_t TEFFE         : 1; // /*!<Tx Event FIFO Full Enable                */
		uint32_t TEFLE         : 1; // /*!<Tx Event FIFO Element Lost Enable        */
		uint32_t TSWE          : 1; // /*!<Timestamp Wraparound Enable              */
		uint32_t MRAFE         : 1; // /*!<Message RAM Access Failure Enable        */
		uint32_t TOOE          : 1; // /*!<Timeout Occurred Enable                  */
		uint32_t ELOE          : 1; // /*!<Error Logging Overflow Enable            */
		uint32_t EPE           : 1; // /*!<Error Passive Enable                     */
		uint32_t EWE           : 1; // /*!<Warning Status Enable                    */
		uint32_t BOE           : 1; // /*!<Bus_Off Status Enable                    */
		uint32_t WDIE          : 1; // /*!<Watchdog Interrupt Enable                */
		uint32_t PEAE          : 1; // /*!<Protocol Error in Arbitration Phase Enable*/
		uint32_t PEDE          : 1; // /*!<Protocol Error in Data Phase Enable      */
		uint32_t ARAE          : 1; // /*!<Access to Reserved Address Enable        */
		uint32_t _reserved24   : 8;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_fdcan_type_a,ie);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_fdcan_type_a,ie),bits);

typedef union {
	struct {
		uint32_t RXFIFO0       : 1; 
		uint32_t RXFIFO1       : 1; 
		uint32_t SMSG          : 1; 
		uint32_t TFERR         : 1; 
		uint32_t MISC          : 1; 
		uint32_t BERR          : 1; 
		uint32_t PERR          : 1; 
		uint32_t _reserved7    :25;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_fdcan_type_a,ils);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_fdcan_type_a,ils),bits);

