vintagepc/MINI404/hw/arm/prusa/stm32_registers/generated/common/FDCAN_TYPE_A_registers.h
typedef union {
	struct {
		uint32_t CF            : 3; // /*!<Cancellation Finished                    */
		uint32_t _reserved3    :29;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_fdcan_type_a,txbcf);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_fdcan_type_a,txbcf),bits);

typedef union {
	struct {
		uint32_t TIE           : 3; // /*!<Transmission Interrupt Enable            */
		uint32_t _reserved3    :29;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_fdcan_type_a,txbtie);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_fdcan_type_a,txbtie),bits);

typedef union {
	struct {
		uint32_t CFIE          : 3; // /*!<Cancellation Finished Interrupt Enable   */
		uint32_t _reserved3    :29;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_fdcan_type_a,txbcie);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_fdcan_type_a,txbcie),bits);

typedef union {
	struct {
		uint32_t EFFL          : 3; // /*!<Event FIFO Fill Level                    */
		uint32_t _reserved3    : 5;
		uint32_t EFGI          : 2; // /*!<Event FIFO Get Index                     */
		uint32_t _reserved10   : 6;
		uint32_t EFPI          : 2; // /*!<Event FIFO Put Index                     */
		uint32_t _reserved18   : 6;
		uint32_t EFF           : 1; // /*!<Event FIFO Full                          */
		uint32_t TEFL          : 1; // /*!<Tx Event FIFO Element Lost               */
		uint32_t _reserved26   : 6;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_fdcan_type_a,txefs);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_fdcan_type_a,txefs),bits);

typedef union {
	struct {
		uint32_t EFAI          : 2; // /*!<Event FIFO Acknowledge Index             */
		uint32_t _reserved2    :30;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_fdcan_type_a,txefa);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_fdcan_type_a,txefa),bits);

typedef union {
	struct {
		uint32_t PDIV          : 4; // /*!<Input Clock Divider                      */
		uint32_t _reserved4    :28;
	} QEMU_PACKED bits;
	uint32_t raw;
}  REGDEF_NAME(com_fdcan_type_a,ckdiv);
CHECK_TYPEDEF_u32(REGDEF_NAME(com_fdcan_type_a,ckdiv),bits);

typedef union {
	struct {
		REGDEF_NAME(com_fdcan_type_a,crel) CREL;
		REGDEF_NAME(com_fdcan_type_a,endn) ENDN;
		uint32_t _reserved0x8;
		REGDEF_NAME(com_fdcan_type_a,dbtp) DBTP;
		REGDEF_NAME(com_fdcan_type_a,test) TEST;
		REGDEF_NAME(com_fdcan_type_a,rwd) RWD;
		REGDEF_NAME(com_fdcan_type_a,cccr) CCCR;
		REGDEF_NAME(com_fdcan_type_a,nbtp) NBTP;
		REGDEF_NAME(com_fdcan_type_a,tscc) TSCC;
		REGDEF_NAME(com_fdcan_type_a,tscv) TSCV;
		REGDEF_NAME(com_fdcan_type_a,tocc) TOCC;
		REGDEF_NAME(com_fdcan_type_a,tocv) TOCV;
		uint32_t _reserved0x30[ 4];
		REGDEF_NAME(com_fdcan_type_a,ecr) ECR;
		REGDEF_NAME(com_fdcan_type_a,psr) PSR;
		REGDEF_NAME(com_fdcan_type_a,tdcr) TDCR;
		uint32_t _reserved0x4C;
		REGDEF_NAME(com_fdcan_type_a,ir) IR;
		REGDEF_NAME(com_fdcan_type_a,ie) IE;
		REGDEF_NAME(com_fdcan_type_a,ils) ILS;
		REGDEF_NAME(com_fdcan_type_a,ile) ILE;
		uint32_t _reserved0x60[ 8];
		REGDEF_NAME(com_fdcan_type_a,rxgfc) RXGFC;
		REGDEF_NAME(com_fdcan_type_a,xidam) XIDAM;
		REGDEF_NAME(com_fdcan_type_a,hpms) HPMS;
		uint32_t _reserved0x8C;
		REGDEF_NAME(com_fdcan_type_a,rxf0s) RXF0S;
		REGDEF_NAME(com_fdcan_type_a,rxf0a) RXF0A;
		REGDEF_NAME(com_fdcan_type_a,rxf1s) RXF1S;
		REGDEF_NAME(com_fdcan_type_a,rxf1a) RXF1A;
		uint32_t _reserved0xA0[ 8];
		REGDEF_NAME(com_fdcan_type_a,txbc) TXBC;
		REGDEF_NAME(com_fdcan_type_a,txfqs) TXFQS;
		REGDEF_NAME(com_fdcan_type_a,txbrp) TXBRP;
		REGDEF_NAME(com_fdcan_type_a,txbar) TXBAR;
		REGDEF_NAME(com_fdcan_type_a,txbcr) TXBCR;
		REGDEF_NAME(com_fdcan_type_a,txbto) TXBTO;
		REGDEF_NAME(com_fdcan_type_a,txbcf) TXBCF;
		REGDEF_NAME(com_fdcan_type_a,txbtie) TXBTIE;
		REGDEF_NAME(com_fdcan_type_a,txbcie) TXBCIE;
		REGDEF_NAME(com_fdcan_type_a,txefs) TXEFS;
		REGDEF_NAME(com_fdcan_type_a,txefa) TXEFA;
		uint32_t _reserved0xEC[ 5];
		REGDEF_NAME(com_fdcan_type_a,ckdiv) CKDIV;
	} /*QEMU_PACKED*/;
	uint32_t raw[RI_END];
}  REGDEF_NAME(stm32com,fdcan_type_a);
QEMU_BUILD_BUG_MSG(sizeof(REGDEF_NAME(stm32com,fdcan_type_a)) != sizeof(uint32_t)*RI_END , "Structure Size mismatch - expected uint32[RI_END]");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan_type_a), CREL) != 0, "Offset mismatch for CREL");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan_type_a), ENDN) != 4, "Offset mismatch for ENDN");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan_type_a), DBTP) != 12, "Offset mismatch for DBTP");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan_type_a), TEST) != 16, "Offset mismatch for TEST");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan_type_a), RWD) != 20, "Offset mismatch for RWD");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan_type_a), CCCR) != 24, "Offset mismatch for CCCR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan_type_a), NBTP) != 28, "Offset mismatch for NBTP");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan_type_a), TSCC) != 32, "Offset mismatch for TSCC");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan_type_a), TSCV) != 36, "Offset mismatch for TSCV");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan_type_a), TOCC) != 40, "Offset mismatch for TOCC");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan_type_a), TOCV) != 44, "Offset mismatch for TOCV");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan_type_a), ECR) != 64, "Offset mismatch for ECR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan_type_a), PSR) != 68, "Offset mismatch for PSR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan_type_a), TDCR) != 72, "Offset mismatch for TDCR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan_type_a), IR) != 80, "Offset mismatch for IR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan_type_a), IE) != 84, "Offset mismatch for IE");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan_type_a), ILS) != 88, "Offset mismatch for ILS");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan_type_a), ILE) != 92, "Offset mismatch for ILE");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan_type_a), RXGFC) != 128, "Offset mismatch for RXGFC");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan_type_a), XIDAM) != 132, "Offset mismatch for XIDAM");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan_type_a), HPMS) != 136, "Offset mismatch for HPMS");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan_type_a), RXF0S) != 144, "Offset mismatch for RXF0S");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan_type_a), RXF0A) != 148, "Offset mismatch for RXF0A");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan_type_a), RXF1S) != 152, "Offset mismatch for RXF1S");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan_type_a), RXF1A) != 156, "Offset mismatch for RXF1A");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan_type_a), TXBC) != 192, "Offset mismatch for TXBC");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan_type_a), TXFQS) != 196, "Offset mismatch for TXFQS");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan_type_a), TXBRP) != 200, "Offset mismatch for TXBRP");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan_type_a), TXBAR) != 204, "Offset mismatch for TXBAR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan_type_a), TXBCR) != 208, "Offset mismatch for TXBCR");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan_type_a), TXBTO) != 212, "Offset mismatch for TXBTO");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan_type_a), TXBCF) != 216, "Offset mismatch for TXBCF");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan_type_a), TXBTIE) != 220, "Offset mismatch for TXBTIE");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan_type_a), TXBCIE) != 224, "Offset mismatch for TXBCIE");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan_type_a), TXEFS) != 228, "Offset mismatch for TXEFS");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan_type_a), TXEFA) != 232, "Offset mismatch for TXEFA");
QEMU_BUILD_BUG_MSG(offsetof(REGDEF_NAME(stm32com,fdcan_type_a), CKDIV) != 256, "Offset mismatch for CKDIV");
